************
# World data
************

In [26]:
import pandas as pd

## Area de los paises

In [27]:
A = pd.read_csv('../dat/table-1.csv')
# source: https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_area
# preprocessed with https://wikitable2csv.ggor.de/

In [28]:
# eliminar los ultimos paises porque tienen areas muy chicas
A2 = A[:-20]

In [29]:
A2[-10:]

,Rank,Sovereign state/dependency,Total in km2 (mi2),Land in km2 (mi2),Water in km2 (mi2),% water,Notes
233,–,British Virgin Islands (United Kingdom),151 (58),151 (58),0 (0),0,NaN
234,–,Wallis and Futuna (France),142 (55),142 (55),0 (0),0,NaN
235,–,Christmas Island (Australia),135 (52),135 (52),0 (0),0,[Note 61]
236,–,Jersey (United Kingdom),116 (45),116 (45),0 (0),0,NaN
237,–,Montserrat (United Kingdom),102 (39),102 (39),0 (0),0,NaN
238,–,Anguilla (United Kingdom),91 (35),91 (35),0 (0),0,NaN
239,–,Guernsey (United Kingdom),78 (30),78 (30),0 (0),0,NaN
240,190,San Marino,61 (24),61 (24),0 (0),0,NaN
241,–,British Indian Ocean Territory (United Kingdom),60 (23),60 (23),"54,340 (20,980)",99.89,[Note 62]
242,–,Saint Martin (France),54 (21),54.4 (21.0),Negligible,Negligible,[Note 16]

In [30]:
d = A2['Total in km2 (mi2)'].values

In [31]:
d[-20:]

array(['264 (102)', '261 (101)', '260 (100)', '253.8 (98.0)', '242 (93)',
       '236 (91)', '199 (77)', '181 (70)', '180 (69)', '160 (62)',
       '151 (58)', '142 (55)', '135 (52)', '116 (45)', '102 (39)',
       '91 (35)', '78 (30)', '61 (24)', '60 (23)', '54 (21)'],
      dtype=object)

In [32]:
area = []
for a in d:
    s = a.split('(')[0].replace(',','').strip()
    s = float(s)
    area.append(s)

In [33]:
area[:10]

[510072000.0,
 17098246.0,
 14000000.0,
 9984670.0,
 9596961.0,
 9525067.0,
 8515767.0,
 7692024.0,
 3287263.0,
 2780400.0]

In [34]:
print(A2.shape)
print(len(area))

(243, 7)
243

In [35]:
country = A2['Sovereign state/dependency'].values
d = {'country': country, 'area': area}
df = pd.DataFrame(data=d)

In [36]:
df.to_csv('../dat/world_area.csv', index=None)

## Poblacion de los paises

In [37]:
P = pd.read_csv('../dat/table-2.csv')
# source: https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)
# preprocessed with https://wikitable2csv.ggor.de/

In [38]:
population = []
for pop in P['Population(1 July 2019)']:
    pp = pop.replace(',','')
    pp = float(pp)
    population.append(pp)

In [39]:
population[:6]

[1433783686.0,
 1366417754.0,
 329064917.0,
 270625568.0,
 216565318.0,
 211049527.0]

In [40]:
P[:5]

,Country or area,UN continentalregion[4],UN statisticalregion[4],Population(1 July 2018),Population(1 July 2019),Change
0,China[a],Asia,Eastern Asia,"1,427,647,786","1,433,783,686",+0.43%
1,India,Asia,Southern Asia,"1,352,642,280","1,366,417,754",+1.02%
2,United States,Americas,Northern America,"327,096,265","329,064,917",+0.60%
3,Indonesia,Asia,South-eastern Asia,"267,670,543","270,625,568",+1.10%
4,Pakistan,Asia,Southern Asia,"212,228,286","216,565,318",+2.04%

In [41]:
P.keys()

Index(['Country or area', 'UN continentalregion[4]', 'UN statisticalregion[4]',
       'Population(1 July 2018)', 'Population(1 July 2019)', 'Change'],
      dtype='object')

In [42]:
country = P['Country or area'].values

In [43]:
d = {'country': country, 'population': population}

In [44]:
df = pd.DataFrame(data=d)

In [45]:
df

              country    population
0            China[a]  1.433784e+09
1               India  1.366418e+09
2       United States  3.290649e+08
3           Indonesia  2.706256e+08
4            Pakistan  2.165653e+08
..                ...           ...
229  Falkland Islands  3.377000e+03
230              Niue  1.615000e+03
231           Tokelau  1.340000e+03
232   Vatican City[u]  7.990000e+02
233             World  7.713468e+09

[234 rows x 2 columns]

In [46]:
df.to_csv('../dat/world_population.csv', index=None)

# Combine area and population data

In [47]:
import pandas as pd

In [48]:
P = pd.read_csv('../dat/population.csv')

In [49]:
P

              country  population
0               China  1433783686
1               India  1366417754
2       United States   329064917
3           Indonesia   270625568
4            Pakistan   216565318
..                ...         ...
228        Montserrat        4989
229  Falkland Islands        3377
230              Niue        1615
231           Tokelau        1340
232      Vatican City         799

[233 rows x 2 columns]

In [50]:
A = pd.read_csv('../dat/area.csv')

In [51]:
A

                                             country      area
0                                             Russia  17098246
1                                         Antarctica  14000000
2                                             Canada   9984670
3                                              China   9596961
4                                      United States   9525067
..                                               ...       ...
237                        Anguilla (United Kingdom)        91
238                        Guernsey (United Kingdom)        78
239                                       San Marino        61
240  British Indian Ocean Territory (United Kingdom)        60
241                            Saint Martin (France)        54

[242 rows x 2 columns]

In [52]:
df = pd.merge(P, A, on='country')

In [53]:
df

                   country  population     area
0                    China  1433783686  9596961
1                    India  1366417754  3287263
2            United States   329064917  9525067
3                Indonesia   270625568  1910931
4                 Pakistan   216565318   907132
..                     ...         ...      ...
180       Marshall Islands       58791      181
181  Saint Kitts and Nevis       52823      261
182          Liechtenstein       38019      160
183             San Marino       33860       61
184                  Palau       18008      459

[185 rows x 3 columns]

In [54]:
df.to_csv('../dat/pop_area.csv')